# GraphicDisplayOptionsShadows Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GraphicDisplayOptionsShadows Property
ParameterTypeId Class See Also
---
"Shadows"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GraphicDisplayOptionsShadows { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GraphicDisplayOptionsShadows As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GraphicDisplayOptionsShadows {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace